{
  "tokens": [
    {
      "code": "STATIC",
      "type": "code",
      "description": "structural",
      "tokenization": {}
    },
    {
      "code": "SEP",
      "type": "code",
      "description": "structural",
      "tokenization": {}
    },
    {
      "code": "MASK",
      "type": "code",
      "description": "structural",
      "tokenization": {}
    },
    {
      "code": "PAD",
      "type": "code",
      "description": "structural",
      "tokenization": {}
    },
    {
      "code": "CLS",
      "type": "code",
      "description": "structural",
      "tokenization": {}
    },
    {
      "code": "DAY_1",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_2",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_3",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_4",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_5",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_6",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_7",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_8",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_9",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_10",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_11",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_12",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_13",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_14",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_15",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_16",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_17",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_18",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_19",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_20",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_21",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_22",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_23",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_24",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_25",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_26",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_27",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_28",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_29",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_30",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_31",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "DAY_32",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_0",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_1",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_2",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_3",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_4",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_5",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_6",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_7",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_8",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_9",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_10",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_11",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_12",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_13",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_14",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_15",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_16",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_17",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_18",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_19",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_20",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_21",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_22",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_23",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "HOUR_24",
      "type": "code",
      "description": "time_block",
      "tokenization": {}
    },
    {
      "code": "FIRST48",
      "type": "code",
      "description": "first48",
      "tokenization": {}
    },
    {
      "code": "heart_rate",
      "type": "code",
      "description": "Heart rate; source=hr",
      "tokenization": {}
    },
    {
      "code": "systolic_bp",
      "type": "code",
      "description": "Systolic blood pressure; source=sbp",
      "tokenization": {}
    },
    {
      "code": "diastolic_bp",
      "type": "code",
      "description": "Diastolic blood pressure; source=dbp",
      "tokenization": {}
    },
    {
      "code": "mean_arterial_pressure",
      "type": "code",
      "description": "Mean arterial pressure; source=map",
      "tokenization": {}
    },
    {
      "code": "respiratory_rate",
      "type": "code",
      "description": "Respiratory rate; source=rr",
      "tokenization": {}
    },
    {
      "code": "temperature",
      "type": "code",
      "description": "Temperature; source=temp",
      "tokenization": {}
    },
    {
      "code": "fio2",
      "type": "code",
      "description": "Fraction of inspired oxygen; source=fio2",
      "tokenization": {}
    },
    {
      "code": "age",
      "type": "code",
      "description": "Age at admission; source=age",
      "tokenization": {}
    },
    {
      "code": "sex",
      "type": "code",
      "description": "Sex; M=male F=female; source=male",
      "tokenization": {}
    },
    {
      "code": "sex",
      "type": "categorical",
      "description": "Sex; M=male F=female=M; source=male:M",
      "tokenization": {
        "category": "M",
        "source_value": "M",
        "source_field": "male"
      }
    },
    {
      "code": "sex",
      "type": "categorical",
      "description": "Sex; M=male F=female=F; source=male:F",
      "tokenization": {
        "category": "F",
        "source_value": "F",
        "source_field": "male"
      }
    },
    {
      "code": "injury_mechanism",
      "type": "code",
      "description": "Injury mechanism; source=mechanism_cat",
      "tokenization": {}
    },
    {
      "code": "injury_mechanism",
      "type": "categorical",
      "description": "Injury mechanism=blunt; source=mechanism_cat:B",
      "tokenization": {
        "category": "blunt",
        "source_value": "B",
        "source_field": "mechanism_cat"
      }
    },
    {
      "code": "injury_mechanism",
      "type": "categorical",
      "description": "Injury mechanism=penetrating; source=mechanism_cat:P",
      "tokenization": {
        "category": "penetrating",
        "source_value": "P",
        "source_field": "mechanism_cat"
      }
    },
    {
      "code": "injury_mechanism",
      "type": "categorical",
      "description": "Injury mechanism=other; source=mechanism_cat:O",
      "tokenization": {
        "category": "other",
        "source_value": "O",
        "source_field": "mechanism_cat"
      }
    },
    {
      "code": "transfer",
      "type": "code",
      "description": "Transfer context; source=transfer",
      "tokenization": {}
    },
    {
      "code": "transfer",
      "type": "categorical",
      "description": "Transfer context=direct; source=transfer:D",
      "tokenization": {
        "category": "direct",
        "source_value": "D",
        "source_field": "transfer"
      }
    },
    {
      "code": "transfer",
      "type": "categorical",
      "description": "Transfer context=transfer; source=transfer:T",
      "tokenization": {
        "category": "transfer",
        "source_value": "T",
        "source_field": "transfer"
      }
    },
    {
      "code": "initial_ed_sbp",
      "type": "code",
      "description": "Initial ED SBP; source=initial_ed_sbp",
      "tokenization": {}
    },
    {
      "code": "initial_ed_sbp",
      "type": "numerical_range",
      "description": "Initial ED SBP: severely_low; source=initial_ed_sbp",
      "tokenization": {
        "unit": "mmHg",
        "range_start": null,
        "range_end": 90,
        "label": "severely_low",
        "source": "UW Initial.ED.SBPCat: <=89 / 90-110 / >=111",
        "source_field": "initial_ed_sbp"
      }
    },
    {
      "code": "initial_ed_sbp",
      "type": "numerical_range",
      "description": "Initial ED SBP: mildly_low; source=initial_ed_sbp",
      "tokenization": {
        "unit": "mmHg",
        "range_start": 90,
        "range_end": 111,
        "label": "mildly_low",
        "source": "UW Initial.ED.SBPCat: <=89 / 90-110 / >=111",
        "source_field": "initial_ed_sbp"
      }
    },
    {
      "code": "initial_ed_sbp",
      "type": "numerical_range",
      "description": "Initial ED SBP: normal; source=initial_ed_sbp",
      "tokenization": {
        "unit": "mmHg",
        "range_start": 111,
        "range_end": null,
        "label": "normal",
        "source": "UW Initial.ED.SBPCat: <=89 / 90-110 / >=111",
        "source_field": "initial_ed_sbp"
      }
    },
    {
      "code": "reverse_shock_index",
      "type": "code",
      "description": "Reverse shock index = SBP/HR; source=rsi",
      "tokenization": {}
    },
    {
      "code": "reverse_shock_index",
      "type": "numerical_range",
      "description": "Reverse shock index = SBP/HR: high_risk; source=rsi",
      "tokenization": {
        "unit": "ratio",
        "range_start": null,
        "range_end": 1.1,
        "label": "high_risk",
        "source": "UW rSICat: <=1.0 / 1.1-1.7 / >=1.8; implemented as <1.1 / 1.1-1.8 / >=1.8",
        "source_field": "rsi"
      }
    },
    {
      "code": "reverse_shock_index",
      "type": "numerical_range",
      "description": "Reverse shock index = SBP/HR: moderate_risk; source=rsi",
      "tokenization": {
        "unit": "ratio",
        "range_start": 1.1,
        "range_end": 1.8,
        "label": "moderate_risk",
        "source": "UW rSICat: <=1.0 / 1.1-1.7 / >=1.8; implemented as <1.1 / 1.1-1.8 / >=1.8",
        "source_field": "rsi"
      }
    },
    {
      "code": "reverse_shock_index",
      "type": "numerical_range",
      "description": "Reverse shock index = SBP/HR: low_risk; source=rsi",
      "tokenization": {
        "unit": "ratio",
        "range_start": 1.8,
        "range_end": null,
        "label": "low_risk",
        "source": "UW rSICat: <=1.0 / 1.1-1.7 / >=1.8; implemented as <1.1 / 1.1-1.8 / >=1.8",
        "source_field": "rsi"
      }
    },
    {
      "code": "head_injury",
      "type": "code",
      "description": "Head injury from ICD; source=head_injury",
      "tokenization": {}
    },
    {
      "code": "head_injury",
      "type": "categorical",
      "description": "Head injury from ICD=yes; source=head_injury:Y",
      "tokenization": {
        "category": "yes",
        "source_value": "Y",
        "source_field": "head_injury"
      }
    },
    {
      "code": "head_injury",
      "type": "categorical",
      "description": "Head injury from ICD=no; source=head_injury:N",
      "tokenization": {
        "category": "no",
        "source_value": "N",
        "source_field": "head_injury"
      }
    },
    {
      "code": "base_deficit_48h",
      "type": "code",
      "description": "First-48h base deficit; source=base_def_48",
      "tokenization": {}
    },
    {
      "code": "base_deficit_48h",
      "type": "numerical_range",
      "description": "First-48h base deficit: normal; source=base_def_48",
      "tokenization": {
        "unit": "mEq/L",
        "range_start": 0,
        "range_end": 3,
        "label": "normal",
        "source": "UW baseDef48Cat: 0-2.9 / 3-5.9 / 6-9.9 / >=10",
        "source_field": "base_def_48"
      }
    },
    {
      "code": "base_deficit_48h",
      "type": "numerical_range",
      "description": "First-48h base deficit: mild; source=base_def_48",
      "tokenization": {
        "unit": "mEq/L",
        "range_start": 3,
        "range_end": 6,
        "label": "mild",
        "source": "UW baseDef48Cat: 0-2.9 / 3-5.9 / 6-9.9 / >=10",
        "source_field": "base_def_48"
      }
    },
    {
      "code": "base_deficit_48h",
      "type": "numerical_range",
      "description": "First-48h base deficit: moderate; source=base_def_48",
      "tokenization": {
        "unit": "mEq/L",
        "range_start": 6,
        "range_end": 10,
        "label": "moderate",
        "source": "UW baseDef48Cat: 0-2.9 / 3-5.9 / 6-9.9 / >=10",
        "source_field": "base_def_48"
      }
    },
    {
      "code": "base_deficit_48h",
      "type": "numerical_range",
      "description": "First-48h base deficit: severe; source=base_def_48",
      "tokenization": {
        "unit": "mEq/L",
        "range_start": 10,
        "range_end": null,
        "label": "severe",
        "source": "UW baseDef48Cat: 0-2.9 / 3-5.9 / 6-9.9 / >=10",
        "source_field": "base_def_48"
      }
    },
    {
      "code": "lactate_48h",
      "type": "code",
      "description": "First-48h lactate; source=lactate_48",
      "tokenization": {}
    },
    {
      "code": "lactate_48h",
      "type": "numerical_range",
      "description": "First-48h lactate: normal; source=lactate_48",
      "tokenization": {
        "unit": "mmol/L",
        "range_start": null,
        "range_end": 3,
        "label": "normal",
        "source": "UW lactate48Cat: <=2.9 / 3.0-5.0 / >=5.1",
        "source_field": "lactate_48"
      }
    },
    {
      "code": "lactate_48h",
      "type": "numerical_range",
      "description": "First-48h lactate: mild; source=lactate_48",
      "tokenization": {
        "unit": "mmol/L",
        "range_start": 3,
        "range_end": 5.1,
        "label": "mild",
        "source": "UW lactate48Cat: <=2.9 / 3.0-5.0 / >=5.1",
        "source_field": "lactate_48"
      }
    },
    {
      "code": "lactate_48h",
      "type": "numerical_range",
      "description": "First-48h lactate: severe; source=lactate_48",
      "tokenization": {
        "unit": "mmol/L",
        "range_start": 5.1,
        "range_end": null,
        "label": "severe",
        "source": "UW lactate48Cat: <=2.9 / 3.0-5.0 / >=5.1",
        "source_field": "lactate_48"
      }
    },
    {
      "code": "rbc_48h",
      "type": "code",
      "description": "First-48h RBC volume; source=rbc_48",
      "tokenization": {}
    },
    {
      "code": "crystalloid_48h",
      "type": "code",
      "description": "First-48h crystalloid volume; source=crys_48",
      "tokenization": {}
    },
    {
      "code": "crystalloid_48h",
      "type": "numerical_range",
      "description": "First-48h crystalloid volume: low_volume; source=crys_48",
      "tokenization": {
        "unit": "mL",
        "range_start": 0,
        "range_end": 2000,
        "label": "low_volume",
        "source": "UW crys48Cat: 0-1999 / 2000-4992 / 5000-9984 / >=10000 mL",
        "source_field": "crys_48"
      }
    },
    {
      "code": "crystalloid_48h",
      "type": "numerical_range",
      "description": "First-48h crystalloid volume: moderate_volume; source=crys_48",
      "tokenization": {
        "unit": "mL",
        "range_start": 2000,
        "range_end": 5000,
        "label": "moderate_volume",
        "source": "UW crys48Cat: 0-1999 / 2000-4992 / 5000-9984 / >=10000 mL",
        "source_field": "crys_48"
      }
    },
    {
      "code": "crystalloid_48h",
      "type": "numerical_range",
      "description": "First-48h crystalloid volume: high_volume; source=crys_48",
      "tokenization": {
        "unit": "mL",
        "range_start": 5000,
        "range_end": 10000,
        "label": "high_volume",
        "source": "UW crys48Cat: 0-1999 / 2000-4992 / 5000-9984 / >=10000 mL",
        "source_field": "crys_48"
      }
    },
    {
      "code": "crystalloid_48h",
      "type": "numerical_range",
      "description": "First-48h crystalloid volume: very_high_volume; source=crys_48",
      "tokenization": {
        "unit": "mL",
        "range_start": 10000,
        "range_end": null,
        "label": "very_high_volume",
        "source": "UW crys48Cat: 0-1999 / 2000-4992 / 5000-9984 / >=10000 mL",
        "source_field": "crys_48"
      }
    },
    {
      "code": "crystalloid_cumulative",
      "type": "code",
      "description": "Cumulative crystalloid; source=bolus_sum_until_h",
      "tokenization": {}
    },
    {
      "code": "rbc_cumulative",
      "type": "code",
      "description": "Cumulative RBC; source=rbc_sum_until_h",
      "tokenization": {}
    },
    {
      "code": "ventilation_status",
      "type": "code",
      "description": "Current ventilation; source=vent_h",
      "tokenization": {}
    },
    {
      "code": "ventilation_days_cumulative",
      "type": "code",
      "description": "Cumulative vent days; source=vent_day_sum_until_h",
      "tokenization": {}
    },
    {
      "code": "bicarbonate",
      "type": "code",
      "description": "Bicarbonate; source=bicarb",
      "tokenization": {}
    },
    {
      "code": "strong_ion_difference",
      "type": "code",
      "description": "Strong ion difference; source=strong_ion",
      "tokenization": {}
    },
    {
      "code": "bun",
      "type": "code",
      "description": "Blood urea nitrogen; source=bun",
      "tokenization": {}
    },
    {
      "code": "creatinine",
      "type": "code",
      "description": "Creatinine; source=creatinine",
      "tokenization": {}
    },
    {
      "code": "wbc",
      "type": "code",
      "description": "White blood cell count; source=wbc",
      "tokenization": {}
    },
    {
      "code": "lymphocytes",
      "type": "code",
      "description": "Absolute lymphocyte count; source=lymphocytes",
      "tokenization": {}
    },
    {
      "code": "neutrophils",
      "type": "code",
      "description": "Absolute neutrophil count; source=neutrophils",
      "tokenization": {}
    },
    {
      "code": "urine_output",
      "type": "code",
      "description": "Urine output; source=uop",
      "tokenization": {}
    }
  ],
  "n_tokens": 119
}